{"config": {"layers": [{"config": {"sparse": false, "input_dtype": "float32", "batch_input_shape": [null, 1, 64, 64], "name": "input_1"}, "name": "input_1", "class_name": "InputLayer", "inbound_nodes": []}, {"config": {"dim_ordering": "th", "nb_row": 3, "activity_regularizer": null, "activation": "linear", "trainable": true, "nb_filter": 32, "subsample": [1, 1], "init": "he_normal", "nb_col": 3, "name": "convolution2d_1", "b_constraint": null, "border_mode": "same", "bias": true, "W_regularizer": null, "b_regularizer": null, "W_constraint": null}, "name": "convolution2d_1", "class_name": "Convolution2D", "inbound_nodes": [[["input_1", 0, 0]]]}, {"config": {"mode": 0, "name": "batchnormalization_1", "beta_regularizer": null, "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 1}, "name": "batchnormalization_1", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_1", 0, 0]]]}, {"config": {"trainable": true, "name": "activation_1", "activation": "relu"}, "name": "activation_1", "class_name": "Activation", "inbound_nodes": [[["batchnormalization_1", 0, 0]]]}, {"config": {"dim_ordering": "th", "nb_row": 3, "activity_regularizer": null, "activation": "linear", "trainable": true, "nb_filter": 32, "subsample": [1, 1], "init": "he_normal", "nb_col": 3, "name": "convolution2d_2", "b_constraint": null, "border_mode": "same", "bias": true, "W_regularizer": null, "b_regularizer": null, "W_constraint": null}, "name": "convolution2d_2", "class_name": "Convolution2D", "inbound_nodes": [[["activation_1", 0, 0]]]}, {"config": {"mode": 0, "name": "batchnormalization_2", "beta_regularizer": null, "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 1}, "name": "batchnormalization_2", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_2", 0, 0]]]}, {"config": {"trainable": true, "name": "activation_2", "activation": "relu"}, "name": "activation_2", "class_name": "Activation", "inbound_nodes": [[["batchnormalization_2", 0, 0]]]}, {"config": {"dim_ordering": "th", "name": "maxpooling2d_1", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "border_mode": "valid"}, "name": "maxpooling2d_1", "class_name": "MaxPooling2D", "inbound_nodes": [[["activation_2", 0, 0]]]}, {"config": {"dim_ordering": "th", "nb_row": 3, "activity_regularizer": null, "activation": "linear", "trainable": true, "nb_filter": 64, "subsample": [1, 1], "init": "he_normal", "nb_col": 3, "name": "convolution2d_3", "b_constraint": null, "border_mode": "same", "bias": true, "W_regularizer": null, "b_regularizer": null, "W_constraint": null}, "name": "convolution2d_3", "class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_1", 0, 0]]]}, {"config": {"mode": 0, "name": "batchnormalization_3", "beta_regularizer": null, "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 1}, "name": "batchnormalization_3", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_3", 0, 0]]]}, {"config": {"trainable": true, "name": "activation_3", "activation": "relu"}, "name": "activation_3", "class_name": "Activation", "inbound_nodes": [[["batchnormalization_3", 0, 0]]]}, {"config": {"dim_ordering": "th", "nb_row": 3, "activity_regularizer": null, "activation": "linear", "trainable": true, "nb_filter": 64, "subsample": [1, 1], "init": "he_normal", "nb_col": 3, "name": "convolution2d_4", "b_constraint": null, "border_mode": "same", "bias": true, "W_regularizer": null, "b_regularizer": null, "W_constraint": null}, "name": "convolution2d_4", "class_name": "Convolution2D", "inbound_nodes": [[["activation_3", 0, 0]]]}, {"config": {"mode": 0, "name": "batchnormalization_4", "beta_regularizer": null, "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 1}, "name": "batchnormalization_4", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_4", 0, 0]]]}, {"config": {"trainable": true, "name": "activation_4", "activation": "relu"}, "name": "activation_4", "class_name": "Activation", "inbound_nodes": [[["batchnormalization_4", 0, 0]]]}, {"config": {"dim_ordering": "th", "name": "maxpooling2d_2", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "border_mode": "valid"}, "name": "maxpooling2d_2", "class_name": "MaxPooling2D", "inbound_nodes": [[["activation_4", 0, 0]]]}, {"config": {"dim_ordering": "th", "nb_row": 3, "activity_regularizer": null, "activation": "linear", "trainable": true, "nb_filter": 96, "subsample": [1, 1], "init": "he_normal", "nb_col": 3, "name": "convolution2d_5", "b_constraint": null, "border_mode": "same", "bias": true, "W_regularizer": null, "b_regularizer": null, "W_constraint": null}, "name": "convolution2d_5", "class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]]}, {"config": {"mode": 0, "name": "batchnormalization_5", "beta_regularizer": null, "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 1}, "name": "batchnormalization_5", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_5", 0, 0]]]}, {"config": {"trainable": true, "name": "activation_5", "activation": "relu"}, "name": "activation_5", "class_name": "Activation", "inbound_nodes": [[["batchnormalization_5", 0, 0]]]}, {"config": {"dim_ordering": "th", "nb_row": 3, "activity_regularizer": null, "activation": "linear", "trainable": true, "nb_filter": 96, "subsample": [1, 1], "init": "he_normal", "nb_col": 3, "name": "convolution2d_6", "b_constraint": null, "border_mode": "same", "bias": true, "W_regularizer": null, "b_regularizer": null, "W_constraint": null}, "name": "convolution2d_6", "class_name": "Convolution2D", "inbound_nodes": [[["activation_5", 0, 0]]]}, {"config": {"mode": 0, "name": "batchnormalization_6", "beta_regularizer": null, "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 1}, "name": "batchnormalization_6", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_6", 0, 0]]]}, {"config": {"trainable": true, "name": "activation_6", "activation": "relu"}, "name": "activation_6", "class_name": "Activation", "inbound_nodes": [[["batchnormalization_6", 0, 0]]]}, {"config": {"dim_ordering": "th", "name": "maxpooling2d_3", "pool_size": [2, 2], "trainable": true, "strides": [2, 2], "border_mode": "valid"}, "name": "maxpooling2d_3", "class_name": "MaxPooling2D", "inbound_nodes": [[["activation_6", 0, 0]]]}, {"config": {"dim_ordering": "th", "nb_row": 3, "activity_regularizer": null, "activation": "linear", "trainable": true, "nb_filter": 128, "subsample": [1, 1], "init": "he_normal", "nb_col": 3, "name": "convolution2d_7", "b_constraint": null, "border_mode": "same", "bias": true, "W_regularizer": null, "b_regularizer": null, "W_constraint": null}, "name": "convolution2d_7", "class_name": "Convolution2D", "inbound_nodes": [[["maxpooling2d_3", 0, 0]]]}, {"config": {"mode": 0, "name": "batchnormalization_7", "beta_regularizer": null, "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 1}, "name": "batchnormalization_7", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_7", 0, 0]]]}, {"config": {"trainable": true, "name": "activation_7", "activation": "relu"}, "name": "activation_7", "class_name": "Activation", "inbound_nodes": [[["batchnormalization_7", 0, 0]]]}, {"config": {"dim_ordering": "th", "nb_row": 3, "activity_regularizer": null, "activation": "linear", "trainable": true, "nb_filter": 128, "subsample": [1, 1], "init": "he_normal", "nb_col": 3, "name": "convolution2d_8", "b_constraint": null, "border_mode": "same", "bias": true, "W_regularizer": null, "b_regularizer": null, "W_constraint": null}, "name": "convolution2d_8", "class_name": "Convolution2D", "inbound_nodes": [[["activation_7", 0, 0]]]}, {"config": {"mode": 0, "name": "batchnormalization_8", "beta_regularizer": null, "gamma_regularizer": null, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "axis": 1}, "name": "batchnormalization_8", "class_name": "BatchNormalization", "inbound_nodes": [[["convolution2d_8", 0, 0]]]}, {"config": {"trainable": true, "name": "activation_8", "activation": "relu"}, "name": "activation_8", "class_name": "Activation", "inbound_nodes": [[["batchnormalization_8", 0, 0]]]}, {"config": {"trainable": true, "name": "globalaveragepooling2d_1", "dim_ordering": "th"}, "name": "globalaveragepooling2d_1", "class_name": "GlobalAveragePooling2D", "inbound_nodes": [[["activation_8", 0, 0]]]}, {"config": {"trainable": true, "input_dim": 128, "activation": "relu", "W_regularizer": null, "b_regularizer": null, "init": "he_normal", "name": "dense_1", "activity_regularizer": {"l2": 9.999999747378752e-06, "name": "L1L2Regularizer", "l1": 0.0}, "bias": true, "output_dim": 512, "b_constraint": null, "W_constraint": null}, "name": "dense_1", "class_name": "Dense", "inbound_nodes": [[["globalaveragepooling2d_1", 0, 0]]]}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_1"}, "name": "dropout_1", "class_name": "Dropout", "inbound_nodes": [[["dense_1", 0, 0]]]}, {"config": {"trainable": true, "input_dim": 512, "activation": "relu", "W_regularizer": null, "b_regularizer": null, "init": "he_normal", "name": "dense_2", "activity_regularizer": {"l2": 9.999999747378752e-06, "name": "L1L2Regularizer", "l1": 0.0}, "bias": true, "output_dim": 256, "b_constraint": null, "W_constraint": null}, "name": "dense_2", "class_name": "Dense", "inbound_nodes": [[["dropout_1", 0, 0]]]}, {"config": {"p": 0.5, "trainable": true, "name": "dropout_2"}, "name": "dropout_2", "class_name": "Dropout", "inbound_nodes": [[["dense_2", 0, 0]]]}, {"config": {"trainable": true, "input_dim": 256, "activation": "softmax", "W_regularizer": null, "b_regularizer": null, "init": "he_normal", "name": "dense_3", "activity_regularizer": null, "bias": true, "output_dim": 37, "b_constraint": null, "W_constraint": null}, "name": "dense_3", "class_name": "Dense", "inbound_nodes": [[["dropout_2", 0, 0]]]}], "name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_3", 0, 0]]}, "class_name": "Model", "keras_version": "1.2.2"}