{"keras_version": "1.2.2", "class_name": "Model", "config": {"name": "model_1", "output_layers": [["dense_3", 0, 0]], "layers": [{"name": "input_1", "inbound_nodes": [], "class_name": "InputLayer", "config": {"input_dtype": "float32", "batch_input_shape": [null, 1, 64, 64], "name": "input_1", "sparse": false}}, {"name": "convolution2d_1", "inbound_nodes": [[["input_1", 0, 0]]], "class_name": "Convolution2D", "config": {"bias": true, "nb_row": 3, "name": "convolution2d_1", "activation": "linear", "dim_ordering": "th", "nb_filter": 16, "b_constraint": null, "init": "he_normal", "activity_regularizer": null, "b_regularizer": null, "trainable": true, "border_mode": "valid", "nb_col": 3, "subsample": [1, 1], "W_regularizer": null, "W_constraint": null}}, {"name": "batchnormalization_1", "inbound_nodes": [[["convolution2d_1", 0, 0]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "axis": 1, "trainable": true, "epsilon": 0.001, "name": "batchnormalization_1", "momentum": 0.99, "mode": 0, "gamma_regularizer": null}}, {"name": "activation_1", "inbound_nodes": [[["batchnormalization_1", 0, 0]]], "class_name": "Activation", "config": {"name": "activation_1", "activation": "elu", "trainable": true}}, {"name": "convolution2d_2", "inbound_nodes": [[["activation_1", 0, 0]]], "class_name": "Convolution2D", "config": {"bias": true, "nb_row": 3, "name": "convolution2d_2", "activation": "linear", "dim_ordering": "th", "nb_filter": 16, "b_constraint": null, "init": "he_normal", "activity_regularizer": null, "b_regularizer": null, "trainable": true, "border_mode": "valid", "nb_col": 3, "subsample": [1, 1], "W_regularizer": null, "W_constraint": null}}, {"name": "batchnormalization_2", "inbound_nodes": [[["convolution2d_2", 0, 0]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "axis": 1, "trainable": true, "epsilon": 0.001, "name": "batchnormalization_2", "momentum": 0.99, "mode": 0, "gamma_regularizer": null}}, {"name": "activation_2", "inbound_nodes": [[["batchnormalization_2", 0, 0]]], "class_name": "Activation", "config": {"name": "activation_2", "activation": "elu", "trainable": true}}, {"name": "maxpooling2d_1", "inbound_nodes": [[["activation_2", 0, 0]]], "class_name": "MaxPooling2D", "config": {"trainable": true, "border_mode": "valid", "name": "maxpooling2d_1", "pool_size": [2, 2], "dim_ordering": "th", "strides": [2, 2]}}, {"name": "convolution2d_3", "inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "class_name": "Convolution2D", "config": {"bias": true, "nb_row": 3, "name": "convolution2d_3", "activation": "linear", "dim_ordering": "th", "nb_filter": 32, "b_constraint": null, "init": "he_normal", "activity_regularizer": null, "b_regularizer": null, "trainable": true, "border_mode": "valid", "nb_col": 3, "subsample": [1, 1], "W_regularizer": null, "W_constraint": null}}, {"name": "batchnormalization_3", "inbound_nodes": [[["convolution2d_3", 0, 0]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "axis": 1, "trainable": true, "epsilon": 0.001, "name": "batchnormalization_3", "momentum": 0.99, "mode": 0, "gamma_regularizer": null}}, {"name": "activation_3", "inbound_nodes": [[["batchnormalization_3", 0, 0]]], "class_name": "Activation", "config": {"name": "activation_3", "activation": "elu", "trainable": true}}, {"name": "convolution2d_4", "inbound_nodes": [[["activation_3", 0, 0]]], "class_name": "Convolution2D", "config": {"bias": true, "nb_row": 3, "name": "convolution2d_4", "activation": "linear", "dim_ordering": "th", "nb_filter": 32, "b_constraint": null, "init": "he_normal", "activity_regularizer": null, "b_regularizer": null, "trainable": true, "border_mode": "valid", "nb_col": 3, "subsample": [1, 1], "W_regularizer": null, "W_constraint": null}}, {"name": "batchnormalization_4", "inbound_nodes": [[["convolution2d_4", 0, 0]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "axis": 1, "trainable": true, "epsilon": 0.001, "name": "batchnormalization_4", "momentum": 0.99, "mode": 0, "gamma_regularizer": null}}, {"name": "activation_4", "inbound_nodes": [[["batchnormalization_4", 0, 0]]], "class_name": "Activation", "config": {"name": "activation_4", "activation": "elu", "trainable": true}}, {"name": "maxpooling2d_2", "inbound_nodes": [[["activation_4", 0, 0]]], "class_name": "MaxPooling2D", "config": {"trainable": true, "border_mode": "valid", "name": "maxpooling2d_2", "pool_size": [2, 2], "dim_ordering": "th", "strides": [2, 2]}}, {"name": "convolution2d_5", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "class_name": "Convolution2D", "config": {"bias": true, "nb_row": 3, "name": "convolution2d_5", "activation": "linear", "dim_ordering": "th", "nb_filter": 48, "b_constraint": null, "init": "he_normal", "activity_regularizer": null, "b_regularizer": null, "trainable": true, "border_mode": "valid", "nb_col": 3, "subsample": [1, 1], "W_regularizer": null, "W_constraint": null}}, {"name": "batchnormalization_5", "inbound_nodes": [[["convolution2d_5", 0, 0]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "axis": 1, "trainable": true, "epsilon": 0.001, "name": "batchnormalization_5", "momentum": 0.99, "mode": 0, "gamma_regularizer": null}}, {"name": "activation_5", "inbound_nodes": [[["batchnormalization_5", 0, 0]]], "class_name": "Activation", "config": {"name": "activation_5", "activation": "elu", "trainable": true}}, {"name": "convolution2d_6", "inbound_nodes": [[["activation_5", 0, 0]]], "class_name": "Convolution2D", "config": {"bias": true, "nb_row": 3, "name": "convolution2d_6", "activation": "linear", "dim_ordering": "th", "nb_filter": 48, "b_constraint": null, "init": "he_normal", "activity_regularizer": null, "b_regularizer": null, "trainable": true, "border_mode": "valid", "nb_col": 3, "subsample": [1, 1], "W_regularizer": null, "W_constraint": null}}, {"name": "batchnormalization_6", "inbound_nodes": [[["convolution2d_6", 0, 0]]], "class_name": "BatchNormalization", "config": {"beta_regularizer": null, "axis": 1, "trainable": true, "epsilon": 0.001, "name": "batchnormalization_6", "momentum": 0.99, "mode": 0, "gamma_regularizer": null}}, {"name": "activation_6", "inbound_nodes": [[["batchnormalization_6", 0, 0]]], "class_name": "Activation", "config": {"name": "activation_6", "activation": "elu", "trainable": true}}, {"name": "maxpooling2d_3", "inbound_nodes": [[["activation_6", 0, 0]]], "class_name": "MaxPooling2D", "config": {"trainable": true, "border_mode": "valid", "name": "maxpooling2d_3", "pool_size": [2, 2], "dim_ordering": "th", "strides": [2, 2]}}, {"name": "flatten_1", "inbound_nodes": [[["maxpooling2d_3", 0, 0]]], "class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"name": "dense_1", "inbound_nodes": [[["flatten_1", 0, 0]]], "class_name": "Dense", "config": {"input_dim": 768, "W_constraint": null, "b_regularizer": null, "activation": "elu", "name": "dense_1", "b_constraint": null, "init": "he_normal", "activity_regularizer": null, "output_dim": 128, "trainable": true, "bias": true, "W_regularizer": null}}, {"name": "dropout_1", "inbound_nodes": [[["dense_1", 0, 0]]], "class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.5, "trainable": true}}, {"name": "dense_2", "inbound_nodes": [[["dropout_1", 0, 0]]], "class_name": "Dense", "config": {"input_dim": 128, "W_constraint": null, "b_regularizer": null, "activation": "elu", "name": "dense_2", "b_constraint": null, "init": "he_normal", "activity_regularizer": null, "output_dim": 64, "trainable": true, "bias": true, "W_regularizer": null}}, {"name": "dropout_2", "inbound_nodes": [[["dense_2", 0, 0]]], "class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"name": "dense_3", "inbound_nodes": [[["dropout_2", 0, 0]]], "class_name": "Dense", "config": {"input_dim": 64, "W_constraint": null, "b_regularizer": null, "activation": "softmax", "name": "dense_3", "b_constraint": null, "init": "he_normal", "activity_regularizer": null, "output_dim": 37, "trainable": true, "bias": true, "W_regularizer": null}}], "input_layers": [["input_1", 0, 0]]}}