{"keras_version": "1.2.2", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["dense_1", 0, 0]], "layers": [{"inbound_nodes": [], "name": "input_1", "config": {"input_dtype": "float32", "name": "input_1", "batch_input_shape": [null, 3, 64, 64], "sparse": false}, "class_name": "InputLayer"}, {"inbound_nodes": [[["input_1", 0, 0]]], "name": "batchnormalization_1", "config": {"axis": 1, "trainable": true, "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "mode": 0, "name": "batchnormalization_1", "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_1", 0, 0]]], "name": "activation_1", "config": {"trainable": true, "activation": "relu", "name": "activation_1"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_1", 0, 0]]], "name": "convolution2d_1", "config": {"nb_filter": 16, "trainable": true, "border_mode": "same", "subsample": [1, 1], "dim_ordering": "th", "b_constraint": null, "W_constraint": null, "nb_col": 3, "b_regularizer": null, "activation": "linear", "nb_row": 3, "bias": true, "activity_regularizer": null, "W_regularizer": null, "name": "convolution2d_1", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_1", 0, 0]]], "name": "batchnormalization_2", "config": {"axis": 1, "trainable": true, "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "mode": 0, "name": "batchnormalization_2", "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_2", 0, 0]]], "name": "activation_2", "config": {"trainable": true, "activation": "relu", "name": "activation_2"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_2", 0, 0]]], "name": "convolution2d_3", "config": {"nb_filter": 64, "trainable": true, "border_mode": "same", "subsample": [1, 1], "dim_ordering": "th", "b_constraint": null, "W_constraint": null, "nb_col": 3, "b_regularizer": null, "activation": "linear", "nb_row": 3, "bias": true, "activity_regularizer": null, "W_regularizer": null, "name": "convolution2d_3", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_3", 0, 0]]], "name": "dropout_1", "config": {"trainable": true, "name": "dropout_1", "p": 0.25}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_1", 0, 0]]], "name": "batchnormalization_3", "config": {"axis": 1, "trainable": true, "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "mode": 0, "name": "batchnormalization_3", "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_3", 0, 0]]], "name": "activation_3", "config": {"trainable": true, "activation": "relu", "name": "activation_3"}, "class_name": "Activation"}, {"inbound_nodes": [[["convolution2d_1", 0, 0]]], "name": "convolution2d_2", "config": {"nb_filter": 64, "trainable": true, "border_mode": "same", "subsample": [1, 1], "dim_ordering": "th", "b_constraint": null, "W_constraint": null, "nb_col": 1, "b_regularizer": null, "activation": "linear", "nb_row": 1, "bias": true, "activity_regularizer": null, "W_regularizer": null, "name": "convolution2d_2", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["activation_3", 0, 0]]], "name": "convolution2d_4", "config": {"nb_filter": 64, "trainable": true, "border_mode": "same", "subsample": [1, 1], "dim_ordering": "th", "b_constraint": null, "W_constraint": null, "nb_col": 3, "b_regularizer": null, "activation": "linear", "nb_row": 3, "bias": true, "activity_regularizer": null, "W_regularizer": null, "name": "convolution2d_4", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_2", 0, 0], ["convolution2d_4", 0, 0]]], "name": "merge_1", "config": {"arguments": {}, "output_shape": null, "output_mask": null, "output_mask_type": "raw", "mode_type": "raw", "name": "merge_1", "mode": "sum", "dot_axes": -1, "concat_axis": -1, "output_shape_type": "raw"}, "class_name": "Merge"}, {"inbound_nodes": [[["merge_1", 0, 0]]], "name": "batchnormalization_4", "config": {"axis": 1, "trainable": true, "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "mode": 0, "name": "batchnormalization_4", "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_4", 0, 0]]], "name": "activation_4", "config": {"trainable": true, "activation": "relu", "name": "activation_4"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_4", 0, 0]]], "name": "convolution2d_5", "config": {"nb_filter": 64, "trainable": true, "border_mode": "same", "subsample": [1, 1], "dim_ordering": "th", "b_constraint": null, "W_constraint": null, "nb_col": 3, "b_regularizer": null, "activation": "linear", "nb_row": 3, "bias": true, "activity_regularizer": null, "W_regularizer": null, "name": "convolution2d_5", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_5", 0, 0]]], "name": "dropout_2", "config": {"trainable": true, "name": "dropout_2", "p": 0.25}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_2", 0, 0]]], "name": "batchnormalization_5", "config": {"axis": 1, "trainable": true, "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "mode": 0, "name": "batchnormalization_5", "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_5", 0, 0]]], "name": "activation_5", "config": {"trainable": true, "activation": "relu", "name": "activation_5"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_5", 0, 0]]], "name": "convolution2d_6", "config": {"nb_filter": 64, "trainable": true, "border_mode": "same", "subsample": [1, 1], "dim_ordering": "th", "b_constraint": null, "W_constraint": null, "nb_col": 3, "b_regularizer": null, "activation": "linear", "nb_row": 3, "bias": true, "activity_regularizer": null, "W_regularizer": null, "name": "convolution2d_6", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["merge_1", 0, 0], ["convolution2d_6", 0, 0]]], "name": "merge_2", "config": {"arguments": {}, "output_shape": null, "output_mask": null, "output_mask_type": "raw", "mode_type": "raw", "name": "merge_2", "mode": "sum", "dot_axes": -1, "concat_axis": -1, "output_shape_type": "raw"}, "class_name": "Merge"}, {"inbound_nodes": [[["merge_2", 0, 0]]], "name": "maxpooling2d_1", "config": {"pool_size": [2, 2], "trainable": true, "border_mode": "valid", "name": "maxpooling2d_1", "dim_ordering": "th", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "name": "batchnormalization_6", "config": {"axis": 1, "trainable": true, "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "mode": 0, "name": "batchnormalization_6", "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_6", 0, 0]]], "name": "activation_6", "config": {"trainable": true, "activation": "relu", "name": "activation_6"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_6", 0, 0]]], "name": "convolution2d_8", "config": {"nb_filter": 128, "trainable": true, "border_mode": "same", "subsample": [1, 1], "dim_ordering": "th", "b_constraint": null, "W_constraint": null, "nb_col": 3, "b_regularizer": null, "activation": "linear", "nb_row": 3, "bias": true, "activity_regularizer": null, "W_regularizer": null, "name": "convolution2d_8", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_8", 0, 0]]], "name": "dropout_3", "config": {"trainable": true, "name": "dropout_3", "p": 0.25}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_3", 0, 0]]], "name": "batchnormalization_7", "config": {"axis": 1, "trainable": true, "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "mode": 0, "name": "batchnormalization_7", "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_7", 0, 0]]], "name": "activation_7", "config": {"trainable": true, "activation": "relu", "name": "activation_7"}, "class_name": "Activation"}, {"inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "name": "convolution2d_7", "config": {"nb_filter": 128, "trainable": true, "border_mode": "same", "subsample": [1, 1], "dim_ordering": "th", "b_constraint": null, "W_constraint": null, "nb_col": 1, "b_regularizer": null, "activation": "linear", "nb_row": 1, "bias": true, "activity_regularizer": null, "W_regularizer": null, "name": "convolution2d_7", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["activation_7", 0, 0]]], "name": "convolution2d_9", "config": {"nb_filter": 128, "trainable": true, "border_mode": "same", "subsample": [1, 1], "dim_ordering": "th", "b_constraint": null, "W_constraint": null, "nb_col": 3, "b_regularizer": null, "activation": "linear", "nb_row": 3, "bias": true, "activity_regularizer": null, "W_regularizer": null, "name": "convolution2d_9", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_7", 0, 0], ["convolution2d_9", 0, 0]]], "name": "merge_3", "config": {"arguments": {}, "output_shape": null, "output_mask": null, "output_mask_type": "raw", "mode_type": "raw", "name": "merge_3", "mode": "sum", "dot_axes": -1, "concat_axis": -1, "output_shape_type": "raw"}, "class_name": "Merge"}, {"inbound_nodes": [[["merge_3", 0, 0]]], "name": "batchnormalization_8", "config": {"axis": 1, "trainable": true, "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "mode": 0, "name": "batchnormalization_8", "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_8", 0, 0]]], "name": "activation_8", "config": {"trainable": true, "activation": "relu", "name": "activation_8"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_8", 0, 0]]], "name": "convolution2d_10", "config": {"nb_filter": 128, "trainable": true, "border_mode": "same", "subsample": [1, 1], "dim_ordering": "th", "b_constraint": null, "W_constraint": null, "nb_col": 3, "b_regularizer": null, "activation": "linear", "nb_row": 3, "bias": true, "activity_regularizer": null, "W_regularizer": null, "name": "convolution2d_10", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_10", 0, 0]]], "name": "dropout_4", "config": {"trainable": true, "name": "dropout_4", "p": 0.25}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_4", 0, 0]]], "name": "batchnormalization_9", "config": {"axis": 1, "trainable": true, "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "mode": 0, "name": "batchnormalization_9", "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_9", 0, 0]]], "name": "activation_9", "config": {"trainable": true, "activation": "relu", "name": "activation_9"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_9", 0, 0]]], "name": "convolution2d_11", "config": {"nb_filter": 128, "trainable": true, "border_mode": "same", "subsample": [1, 1], "dim_ordering": "th", "b_constraint": null, "W_constraint": null, "nb_col": 3, "b_regularizer": null, "activation": "linear", "nb_row": 3, "bias": true, "activity_regularizer": null, "W_regularizer": null, "name": "convolution2d_11", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["merge_3", 0, 0], ["convolution2d_11", 0, 0]]], "name": "merge_4", "config": {"arguments": {}, "output_shape": null, "output_mask": null, "output_mask_type": "raw", "mode_type": "raw", "name": "merge_4", "mode": "sum", "dot_axes": -1, "concat_axis": -1, "output_shape_type": "raw"}, "class_name": "Merge"}, {"inbound_nodes": [[["merge_4", 0, 0]]], "name": "maxpooling2d_2", "config": {"pool_size": [2, 2], "trainable": true, "border_mode": "valid", "name": "maxpooling2d_2", "dim_ordering": "th", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "name": "batchnormalization_10", "config": {"axis": 1, "trainable": true, "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "mode": 0, "name": "batchnormalization_10", "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_10", 0, 0]]], "name": "activation_10", "config": {"trainable": true, "activation": "relu", "name": "activation_10"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_10", 0, 0]]], "name": "convolution2d_13", "config": {"nb_filter": 256, "trainable": true, "border_mode": "same", "subsample": [1, 1], "dim_ordering": "th", "b_constraint": null, "W_constraint": null, "nb_col": 3, "b_regularizer": null, "activation": "linear", "nb_row": 3, "bias": true, "activity_regularizer": null, "W_regularizer": null, "name": "convolution2d_13", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_13", 0, 0]]], "name": "dropout_5", "config": {"trainable": true, "name": "dropout_5", "p": 0.25}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_5", 0, 0]]], "name": "batchnormalization_11", "config": {"axis": 1, "trainable": true, "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "mode": 0, "name": "batchnormalization_11", "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_11", 0, 0]]], "name": "activation_11", "config": {"trainable": true, "activation": "relu", "name": "activation_11"}, "class_name": "Activation"}, {"inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "name": "convolution2d_12", "config": {"nb_filter": 256, "trainable": true, "border_mode": "same", "subsample": [1, 1], "dim_ordering": "th", "b_constraint": null, "W_constraint": null, "nb_col": 1, "b_regularizer": null, "activation": "linear", "nb_row": 1, "bias": true, "activity_regularizer": null, "W_regularizer": null, "name": "convolution2d_12", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["activation_11", 0, 0]]], "name": "convolution2d_14", "config": {"nb_filter": 256, "trainable": true, "border_mode": "same", "subsample": [1, 1], "dim_ordering": "th", "b_constraint": null, "W_constraint": null, "nb_col": 3, "b_regularizer": null, "activation": "linear", "nb_row": 3, "bias": true, "activity_regularizer": null, "W_regularizer": null, "name": "convolution2d_14", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_12", 0, 0], ["convolution2d_14", 0, 0]]], "name": "merge_5", "config": {"arguments": {}, "output_shape": null, "output_mask": null, "output_mask_type": "raw", "mode_type": "raw", "name": "merge_5", "mode": "sum", "dot_axes": -1, "concat_axis": -1, "output_shape_type": "raw"}, "class_name": "Merge"}, {"inbound_nodes": [[["merge_5", 0, 0]]], "name": "batchnormalization_12", "config": {"axis": 1, "trainable": true, "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "mode": 0, "name": "batchnormalization_12", "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_12", 0, 0]]], "name": "activation_12", "config": {"trainable": true, "activation": "relu", "name": "activation_12"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_12", 0, 0]]], "name": "convolution2d_15", "config": {"nb_filter": 256, "trainable": true, "border_mode": "same", "subsample": [1, 1], "dim_ordering": "th", "b_constraint": null, "W_constraint": null, "nb_col": 3, "b_regularizer": null, "activation": "linear", "nb_row": 3, "bias": true, "activity_regularizer": null, "W_regularizer": null, "name": "convolution2d_15", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["convolution2d_15", 0, 0]]], "name": "dropout_6", "config": {"trainable": true, "name": "dropout_6", "p": 0.25}, "class_name": "Dropout"}, {"inbound_nodes": [[["dropout_6", 0, 0]]], "name": "batchnormalization_13", "config": {"axis": 1, "trainable": true, "momentum": 0.99, "epsilon": 0.001, "gamma_regularizer": null, "mode": 0, "name": "batchnormalization_13", "beta_regularizer": null}, "class_name": "BatchNormalization"}, {"inbound_nodes": [[["batchnormalization_13", 0, 0]]], "name": "activation_13", "config": {"trainable": true, "activation": "relu", "name": "activation_13"}, "class_name": "Activation"}, {"inbound_nodes": [[["activation_13", 0, 0]]], "name": "convolution2d_16", "config": {"nb_filter": 256, "trainable": true, "border_mode": "same", "subsample": [1, 1], "dim_ordering": "th", "b_constraint": null, "W_constraint": null, "nb_col": 3, "b_regularizer": null, "activation": "linear", "nb_row": 3, "bias": true, "activity_regularizer": null, "W_regularizer": null, "name": "convolution2d_16", "init": "glorot_uniform"}, "class_name": "Convolution2D"}, {"inbound_nodes": [[["merge_5", 0, 0], ["convolution2d_16", 0, 0]]], "name": "merge_6", "config": {"arguments": {}, "output_shape": null, "output_mask": null, "output_mask_type": "raw", "mode_type": "raw", "name": "merge_6", "mode": "sum", "dot_axes": -1, "concat_axis": -1, "output_shape_type": "raw"}, "class_name": "Merge"}, {"inbound_nodes": [[["merge_6", 0, 0]]], "name": "globalaveragepooling2d_1", "config": {"trainable": true, "name": "globalaveragepooling2d_1", "dim_ordering": "th"}, "class_name": "GlobalAveragePooling2D"}, {"inbound_nodes": [[["globalaveragepooling2d_1", 0, 0]]], "name": "dense_1", "config": {"W_constraint": null, "trainable": true, "output_dim": 26, "b_constraint": null, "input_dim": 256, "b_regularizer": null, "activation": "softmax", "activity_regularizer": null, "bias": true, "W_regularizer": null, "name": "dense_1", "init": "glorot_uniform"}, "class_name": "Dense"}]}, "class_name": "Model"}