{"class_name": "Model", "config": {"layers": [{"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"input_dtype": "float32", "batch_input_shape": [null, 1, 64, 64], "name": "input_1", "sparse": false}}, {"class_name": "Convolution2D", "name": "convolution2d_1", "inbound_nodes": [[["input_1", 0, 0]]], "config": {"activity_regularizer": null, "b_regularizer": null, "border_mode": "same", "init": "he_normal", "name": "convolution2d_1", "W_constraint": null, "b_constraint": null, "bias": true, "trainable": true, "nb_col": 3, "W_regularizer": null, "dim_ordering": "th", "nb_row": 3, "activation": "linear", "nb_filter": 16, "subsample": [1, 1]}}, {"class_name": "BatchNormalization", "name": "batchnormalization_1", "inbound_nodes": [[["convolution2d_1", 0, 0]]], "config": {"name": "batchnormalization_1", "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "mode": 0, "axis": 1, "epsilon": 0.001, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_1", "inbound_nodes": [[["batchnormalization_1", 0, 0]]], "config": {"name": "activation_1", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "name": "convolution2d_2", "inbound_nodes": [[["activation_1", 0, 0]]], "config": {"activity_regularizer": null, "b_regularizer": null, "border_mode": "same", "init": "he_normal", "name": "convolution2d_2", "W_constraint": null, "b_constraint": null, "bias": true, "trainable": true, "nb_col": 3, "W_regularizer": null, "dim_ordering": "th", "nb_row": 3, "activation": "linear", "nb_filter": 16, "subsample": [1, 1]}}, {"class_name": "BatchNormalization", "name": "batchnormalization_2", "inbound_nodes": [[["convolution2d_2", 0, 0]]], "config": {"name": "batchnormalization_2", "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "mode": 0, "axis": 1, "epsilon": 0.001, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_2", "inbound_nodes": [[["batchnormalization_2", 0, 0]]], "config": {"name": "activation_2", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "name": "maxpooling2d_1", "inbound_nodes": [[["activation_2", 0, 0]]], "config": {"name": "maxpooling2d_1", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2]}}, {"class_name": "Convolution2D", "name": "convolution2d_3", "inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "config": {"activity_regularizer": null, "b_regularizer": null, "border_mode": "same", "init": "he_normal", "name": "convolution2d_3", "W_constraint": null, "b_constraint": null, "bias": true, "trainable": true, "nb_col": 3, "W_regularizer": null, "dim_ordering": "th", "nb_row": 3, "activation": "linear", "nb_filter": 24, "subsample": [1, 1]}}, {"class_name": "BatchNormalization", "name": "batchnormalization_3", "inbound_nodes": [[["convolution2d_3", 0, 0]]], "config": {"name": "batchnormalization_3", "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "mode": 0, "axis": 1, "epsilon": 0.001, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_3", "inbound_nodes": [[["batchnormalization_3", 0, 0]]], "config": {"name": "activation_3", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "name": "convolution2d_4", "inbound_nodes": [[["activation_3", 0, 0]]], "config": {"activity_regularizer": null, "b_regularizer": null, "border_mode": "same", "init": "he_normal", "name": "convolution2d_4", "W_constraint": null, "b_constraint": null, "bias": true, "trainable": true, "nb_col": 3, "W_regularizer": null, "dim_ordering": "th", "nb_row": 3, "activation": "linear", "nb_filter": 24, "subsample": [1, 1]}}, {"class_name": "BatchNormalization", "name": "batchnormalization_4", "inbound_nodes": [[["convolution2d_4", 0, 0]]], "config": {"name": "batchnormalization_4", "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "mode": 0, "axis": 1, "epsilon": 0.001, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_4", "inbound_nodes": [[["batchnormalization_4", 0, 0]]], "config": {"name": "activation_4", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "name": "maxpooling2d_2", "inbound_nodes": [[["activation_4", 0, 0]]], "config": {"name": "maxpooling2d_2", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2]}}, {"class_name": "Convolution2D", "name": "convolution2d_5", "inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "config": {"activity_regularizer": null, "b_regularizer": null, "border_mode": "same", "init": "he_normal", "name": "convolution2d_5", "W_constraint": null, "b_constraint": null, "bias": true, "trainable": true, "nb_col": 3, "W_regularizer": null, "dim_ordering": "th", "nb_row": 3, "activation": "linear", "nb_filter": 32, "subsample": [1, 1]}}, {"class_name": "BatchNormalization", "name": "batchnormalization_5", "inbound_nodes": [[["convolution2d_5", 0, 0]]], "config": {"name": "batchnormalization_5", "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "mode": 0, "axis": 1, "epsilon": 0.001, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_5", "inbound_nodes": [[["batchnormalization_5", 0, 0]]], "config": {"name": "activation_5", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "name": "convolution2d_6", "inbound_nodes": [[["activation_5", 0, 0]]], "config": {"activity_regularizer": null, "b_regularizer": null, "border_mode": "same", "init": "he_normal", "name": "convolution2d_6", "W_constraint": null, "b_constraint": null, "bias": true, "trainable": true, "nb_col": 3, "W_regularizer": null, "dim_ordering": "th", "nb_row": 3, "activation": "linear", "nb_filter": 32, "subsample": [1, 1]}}, {"class_name": "BatchNormalization", "name": "batchnormalization_6", "inbound_nodes": [[["convolution2d_6", 0, 0]]], "config": {"name": "batchnormalization_6", "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "mode": 0, "axis": 1, "epsilon": 0.001, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_6", "inbound_nodes": [[["batchnormalization_6", 0, 0]]], "config": {"name": "activation_6", "activation": "relu", "trainable": true}}, {"class_name": "MaxPooling2D", "name": "maxpooling2d_3", "inbound_nodes": [[["activation_6", 0, 0]]], "config": {"name": "maxpooling2d_3", "trainable": true, "dim_ordering": "th", "pool_size": [2, 2], "border_mode": "valid", "strides": [2, 2]}}, {"class_name": "Convolution2D", "name": "convolution2d_7", "inbound_nodes": [[["maxpooling2d_3", 0, 0]]], "config": {"activity_regularizer": null, "b_regularizer": null, "border_mode": "same", "init": "he_normal", "name": "convolution2d_7", "W_constraint": null, "b_constraint": null, "bias": true, "trainable": true, "nb_col": 3, "W_regularizer": null, "dim_ordering": "th", "nb_row": 3, "activation": "linear", "nb_filter": 40, "subsample": [1, 1]}}, {"class_name": "BatchNormalization", "name": "batchnormalization_7", "inbound_nodes": [[["convolution2d_7", 0, 0]]], "config": {"name": "batchnormalization_7", "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "mode": 0, "axis": 1, "epsilon": 0.001, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_7", "inbound_nodes": [[["batchnormalization_7", 0, 0]]], "config": {"name": "activation_7", "activation": "relu", "trainable": true}}, {"class_name": "Convolution2D", "name": "convolution2d_8", "inbound_nodes": [[["activation_7", 0, 0]]], "config": {"activity_regularizer": null, "b_regularizer": null, "border_mode": "same", "init": "he_normal", "name": "convolution2d_8", "W_constraint": null, "b_constraint": null, "bias": true, "trainable": true, "nb_col": 3, "W_regularizer": null, "dim_ordering": "th", "nb_row": 3, "activation": "linear", "nb_filter": 40, "subsample": [1, 1]}}, {"class_name": "BatchNormalization", "name": "batchnormalization_8", "inbound_nodes": [[["convolution2d_8", 0, 0]]], "config": {"name": "batchnormalization_8", "trainable": true, "gamma_regularizer": null, "momentum": 0.99, "mode": 0, "axis": 1, "epsilon": 0.001, "beta_regularizer": null}}, {"class_name": "Activation", "name": "activation_8", "inbound_nodes": [[["batchnormalization_8", 0, 0]]], "config": {"name": "activation_8", "activation": "relu", "trainable": true}}, {"class_name": "GlobalAveragePooling2D", "name": "globalaveragepooling2d_1", "inbound_nodes": [[["activation_8", 0, 0]]], "config": {"trainable": true, "name": "globalaveragepooling2d_1", "dim_ordering": "th"}}, {"class_name": "Dense", "name": "dense_1", "inbound_nodes": [[["globalaveragepooling2d_1", 0, 0]]], "config": {"activity_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 9.999999747378752e-06}, "b_regularizer": null, "init": "he_normal", "name": "dense_1", "W_constraint": null, "b_constraint": null, "input_dim": 40, "trainable": true, "W_regularizer": null, "output_dim": 128, "activation": "relu", "bias": true}}, {"class_name": "Dropout", "name": "dropout_1", "inbound_nodes": [[["dense_1", 0, 0]]], "config": {"p": 0.15, "name": "dropout_1", "trainable": true}}, {"class_name": "Dense", "name": "dense_2", "inbound_nodes": [[["dropout_1", 0, 0]]], "config": {"activity_regularizer": {"l1": 0.0, "name": "L1L2Regularizer", "l2": 9.999999747378752e-06}, "b_regularizer": null, "init": "he_normal", "name": "dense_2", "W_constraint": null, "b_constraint": null, "input_dim": 128, "trainable": true, "W_regularizer": null, "output_dim": 64, "activation": "relu", "bias": true}}, {"class_name": "Dropout", "name": "dropout_2", "inbound_nodes": [[["dense_2", 0, 0]]], "config": {"p": 0.15, "name": "dropout_2", "trainable": true}}, {"class_name": "Dense", "name": "dense_3", "inbound_nodes": [[["dropout_2", 0, 0]]], "config": {"activity_regularizer": null, "b_regularizer": null, "init": "he_normal", "name": "dense_3", "W_constraint": null, "b_constraint": null, "input_dim": 64, "trainable": true, "W_regularizer": null, "output_dim": 37, "activation": "softmax", "bias": true}}], "name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["dense_3", 0, 0]]}, "keras_version": "1.2.2"}