{"class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"name": "lstm_1", "return_sequences": false, "b_regularizer": null, "init": "glorot_uniform", "inner_init": "orthogonal", "batch_input_shape": [null, 20, 37], "stateful": false, "dropout_U": 0.0, "trainable": true, "output_dim": 128, "inner_activation": "hard_sigmoid", "U_regularizer": null, "consume_less": "cpu", "W_regularizer": null, "dropout_W": 0.0, "activation": "tanh", "input_length": null, "go_backwards": false, "unroll": false, "input_dim": 37, "input_dtype": "float32", "forget_bias_init": "one"}}, {"class_name": "Dense", "config": {"name": "dense_1", "input_dim": 128, "b_constraint": null, "b_regularizer": null, "trainable": true, "output_dim": 37, "activity_regularizer": null, "W_constraint": null, "init": "glorot_uniform", "W_regularizer": null, "activation": "linear", "bias": true}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "softmax"}}], "keras_version": "1.2.2"}