{"keras_version": "1.2.2", "class_name": "Sequential", "config": [{"class_name": "LSTM", "config": {"inner_init": "orthogonal", "b_regularizer": null, "inner_activation": "hard_sigmoid", "name": "lstm_1", "consume_less": "cpu", "input_dim": 27, "W_regularizer": null, "input_length": null, "activation": "tanh", "output_dim": 128, "go_backwards": false, "U_regularizer": null, "unroll": false, "init": "glorot_uniform", "forget_bias_init": "one", "dropout_W": 0.0, "input_dtype": "float32", "trainable": true, "dropout_U": 0.0, "stateful": false, "return_sequences": false, "batch_input_shape": [null, 20, 27]}}, {"class_name": "Dense", "config": {"b_regularizer": null, "init": "glorot_uniform", "name": "dense_1", "output_dim": 27, "W_constraint": null, "W_regularizer": null, "trainable": true, "activation": "linear", "b_constraint": null, "input_dim": 128, "bias": true, "activity_regularizer": null}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "softmax"}}]}