{"class_name": "Model", "keras_version": "1.2.2", "config": {"layers": [{"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"batch_input_shape": [null, 3, null, null], "input_dtype": "float32", "name": "input_1", "sparse": false}}, {"class_name": "Convolution2D", "name": "block1_conv1", "inbound_nodes": [[["input_1", 0, 0]]], "config": {"W_constraint": null, "nb_col": 3, "bias": true, "activation": "relu", "b_regularizer": null, "trainable": false, "init": "glorot_uniform", "activity_regularizer": null, "nb_filter": 64, "dim_ordering": "th", "name": "block1_conv1", "b_constraint": null, "W_regularizer": null, "nb_row": 3, "subsample": [1, 1], "border_mode": "same"}}, {"class_name": "Convolution2D", "name": "block1_conv2", "inbound_nodes": [[["block1_conv1", 0, 0]]], "config": {"W_constraint": null, "nb_col": 3, "bias": true, "activation": "relu", "b_regularizer": null, "trainable": false, "init": "glorot_uniform", "activity_regularizer": null, "nb_filter": 64, "dim_ordering": "th", "name": "block1_conv2", "b_constraint": null, "W_regularizer": null, "nb_row": 3, "subsample": [1, 1], "border_mode": "same"}}, {"class_name": "MaxPooling2D", "name": "block1_pool", "inbound_nodes": [[["block1_conv2", 0, 0]]], "config": {"dim_ordering": "th", "name": "block1_pool", "trainable": false, "strides": [2, 2], "border_mode": "valid", "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "name": "block2_conv1", "inbound_nodes": [[["block1_pool", 0, 0]]], "config": {"W_constraint": null, "nb_col": 3, "bias": true, "activation": "relu", "b_regularizer": null, "trainable": false, "init": "glorot_uniform", "activity_regularizer": null, "nb_filter": 128, "dim_ordering": "th", "name": "block2_conv1", "b_constraint": null, "W_regularizer": null, "nb_row": 3, "subsample": [1, 1], "border_mode": "same"}}, {"class_name": "Convolution2D", "name": "block2_conv2", "inbound_nodes": [[["block2_conv1", 0, 0]]], "config": {"W_constraint": null, "nb_col": 3, "bias": true, "activation": "relu", "b_regularizer": null, "trainable": false, "init": "glorot_uniform", "activity_regularizer": null, "nb_filter": 128, "dim_ordering": "th", "name": "block2_conv2", "b_constraint": null, "W_regularizer": null, "nb_row": 3, "subsample": [1, 1], "border_mode": "same"}}, {"class_name": "MaxPooling2D", "name": "block2_pool", "inbound_nodes": [[["block2_conv2", 0, 0]]], "config": {"dim_ordering": "th", "name": "block2_pool", "trainable": false, "strides": [2, 2], "border_mode": "valid", "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "name": "block3_conv1", "inbound_nodes": [[["block2_pool", 0, 0]]], "config": {"W_constraint": null, "nb_col": 3, "bias": true, "activation": "relu", "b_regularizer": null, "trainable": false, "init": "glorot_uniform", "activity_regularizer": null, "nb_filter": 256, "dim_ordering": "th", "name": "block3_conv1", "b_constraint": null, "W_regularizer": null, "nb_row": 3, "subsample": [1, 1], "border_mode": "same"}}, {"class_name": "Convolution2D", "name": "block3_conv2", "inbound_nodes": [[["block3_conv1", 0, 0]]], "config": {"W_constraint": null, "nb_col": 3, "bias": true, "activation": "relu", "b_regularizer": null, "trainable": false, "init": "glorot_uniform", "activity_regularizer": null, "nb_filter": 256, "dim_ordering": "th", "name": "block3_conv2", "b_constraint": null, "W_regularizer": null, "nb_row": 3, "subsample": [1, 1], "border_mode": "same"}}, {"class_name": "Convolution2D", "name": "block3_conv3", "inbound_nodes": [[["block3_conv2", 0, 0]]], "config": {"W_constraint": null, "nb_col": 3, "bias": true, "activation": "relu", "b_regularizer": null, "trainable": false, "init": "glorot_uniform", "activity_regularizer": null, "nb_filter": 256, "dim_ordering": "th", "name": "block3_conv3", "b_constraint": null, "W_regularizer": null, "nb_row": 3, "subsample": [1, 1], "border_mode": "same"}}, {"class_name": "MaxPooling2D", "name": "block3_pool", "inbound_nodes": [[["block3_conv3", 0, 0]]], "config": {"dim_ordering": "th", "name": "block3_pool", "trainable": false, "strides": [2, 2], "border_mode": "valid", "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "name": "block4_conv1", "inbound_nodes": [[["block3_pool", 0, 0]]], "config": {"W_constraint": null, "nb_col": 3, "bias": true, "activation": "relu", "b_regularizer": null, "trainable": false, "init": "glorot_uniform", "activity_regularizer": null, "nb_filter": 512, "dim_ordering": "th", "name": "block4_conv1", "b_constraint": null, "W_regularizer": null, "nb_row": 3, "subsample": [1, 1], "border_mode": "same"}}, {"class_name": "Convolution2D", "name": "block4_conv2", "inbound_nodes": [[["block4_conv1", 0, 0]]], "config": {"W_constraint": null, "nb_col": 3, "bias": true, "activation": "relu", "b_regularizer": null, "trainable": false, "init": "glorot_uniform", "activity_regularizer": null, "nb_filter": 512, "dim_ordering": "th", "name": "block4_conv2", "b_constraint": null, "W_regularizer": null, "nb_row": 3, "subsample": [1, 1], "border_mode": "same"}}, {"class_name": "Convolution2D", "name": "block4_conv3", "inbound_nodes": [[["block4_conv2", 0, 0]]], "config": {"W_constraint": null, "nb_col": 3, "bias": true, "activation": "relu", "b_regularizer": null, "trainable": false, "init": "glorot_uniform", "activity_regularizer": null, "nb_filter": 512, "dim_ordering": "th", "name": "block4_conv3", "b_constraint": null, "W_regularizer": null, "nb_row": 3, "subsample": [1, 1], "border_mode": "same"}}, {"class_name": "MaxPooling2D", "name": "block4_pool", "inbound_nodes": [[["block4_conv3", 0, 0]]], "config": {"dim_ordering": "th", "name": "block4_pool", "trainable": false, "strides": [2, 2], "border_mode": "valid", "pool_size": [2, 2]}}, {"class_name": "Convolution2D", "name": "block5_conv1", "inbound_nodes": [[["block4_pool", 0, 0]]], "config": {"W_constraint": null, "nb_col": 3, "bias": true, "activation": "relu", "b_regularizer": null, "trainable": false, "init": "glorot_uniform", "activity_regularizer": null, "nb_filter": 512, "dim_ordering": "th", "name": "block5_conv1", "b_constraint": null, "W_regularizer": null, "nb_row": 3, "subsample": [1, 1], "border_mode": "same"}}, {"class_name": "Convolution2D", "name": "block5_conv2", "inbound_nodes": [[["block5_conv1", 0, 0]]], "config": {"W_constraint": null, "nb_col": 3, "bias": true, "activation": "relu", "b_regularizer": null, "trainable": false, "init": "glorot_uniform", "activity_regularizer": null, "nb_filter": 512, "dim_ordering": "th", "name": "block5_conv2", "b_constraint": null, "W_regularizer": null, "nb_row": 3, "subsample": [1, 1], "border_mode": "same"}}, {"class_name": "Convolution2D", "name": "block5_conv3", "inbound_nodes": [[["block5_conv2", 0, 0]]], "config": {"W_constraint": null, "nb_col": 3, "bias": true, "activation": "relu", "b_regularizer": null, "trainable": false, "init": "glorot_uniform", "activity_regularizer": null, "nb_filter": 512, "dim_ordering": "th", "name": "block5_conv3", "b_constraint": null, "W_regularizer": null, "nb_row": 3, "subsample": [1, 1], "border_mode": "same"}}, {"class_name": "Convolution2D", "name": "convolution2d_1", "inbound_nodes": [[["block1_conv2", 0, 0]]], "config": {"W_constraint": null, "nb_col": 1, "bias": true, "activation": "linear", "b_regularizer": null, "trainable": true, "init": "he_normal", "activity_regularizer": null, "nb_filter": 64, "dim_ordering": "th", "name": "convolution2d_1", "b_constraint": null, "W_regularizer": null, "nb_row": 1, "subsample": [1, 1], "border_mode": "same"}}, {"class_name": "Convolution2D", "name": "convolution2d_3", "inbound_nodes": [[["block2_conv2", 0, 0]]], "config": {"W_constraint": null, "nb_col": 1, "bias": true, "activation": "linear", "b_regularizer": null, "trainable": true, "init": "he_normal", "activity_regularizer": null, "nb_filter": 128, "dim_ordering": "th", "name": "convolution2d_3", "b_constraint": null, "W_regularizer": null, "nb_row": 1, "subsample": [1, 1], "border_mode": "same"}}, {"class_name": "Convolution2D", "name": "convolution2d_5", "inbound_nodes": [[["block3_conv3", 0, 0]]], "config": {"W_constraint": null, "nb_col": 1, "bias": true, "activation": "linear", "b_regularizer": null, "trainable": true, "init": "he_normal", "activity_regularizer": null, "nb_filter": 256, "dim_ordering": "th", "name": "convolution2d_5", "b_constraint": null, "W_regularizer": null, "nb_row": 1, "subsample": [1, 1], "border_mode": "same"}}, {"class_name": "Convolution2D", "name": "convolution2d_7", "inbound_nodes": [[["block4_conv3", 0, 0]]], "config": {"W_constraint": null, "nb_col": 1, "bias": true, "activation": "linear", "b_regularizer": null, "trainable": true, "init": "he_normal", "activity_regularizer": null, "nb_filter": 512, "dim_ordering": "th", "name": "convolution2d_7", "b_constraint": null, "W_regularizer": null, "nb_row": 1, "subsample": [1, 1], "border_mode": "same"}}, {"class_name": "Convolution2D", "name": "convolution2d_9", "inbound_nodes": [[["block5_conv3", 0, 0]]], "config": {"W_constraint": null, "nb_col": 1, "bias": true, "activation": "linear", "b_regularizer": null, "trainable": true, "init": "he_normal", "activity_regularizer": null, "nb_filter": 512, "dim_ordering": "th", "name": "convolution2d_9", "b_constraint": null, "W_regularizer": null, "nb_row": 1, "subsample": [1, 1], "border_mode": "same"}}, {"class_name": "Activation", "name": "activation_1", "inbound_nodes": [[["convolution2d_1", 0, 0]]], "config": {"trainable": true, "name": "activation_1", "activation": "elu"}}, {"class_name": "Activation", "name": "activation_2", "inbound_nodes": [[["convolution2d_3", 0, 0]]], "config": {"trainable": true, "name": "activation_2", "activation": "elu"}}, {"class_name": "Activation", "name": "activation_3", "inbound_nodes": [[["convolution2d_5", 0, 0]]], "config": {"trainable": true, "name": "activation_3", "activation": "elu"}}, {"class_name": "Activation", "name": "activation_4", "inbound_nodes": [[["convolution2d_7", 0, 0]]], "config": {"trainable": true, "name": "activation_4", "activation": "elu"}}, {"class_name": "Activation", "name": "activation_5", "inbound_nodes": [[["convolution2d_9", 0, 0]]], "config": {"trainable": true, "name": "activation_5", "activation": "elu"}}, {"class_name": "UpSampling2D", "name": "upsampling2d_1", "inbound_nodes": [[["activation_1", 0, 0]]], "config": {"size": [1, 1], "trainable": true, "name": "upsampling2d_1"}}, {"class_name": "UpSampling2D", "name": "upsampling2d_2", "inbound_nodes": [[["activation_2", 0, 0]]], "config": {"size": [2, 2], "trainable": true, "name": "upsampling2d_2"}}, {"class_name": "UpSampling2D", "name": "upsampling2d_3", "inbound_nodes": [[["activation_3", 0, 0]]], "config": {"size": [4, 4], "trainable": true, "name": "upsampling2d_3"}}, {"class_name": "UpSampling2D", "name": "upsampling2d_4", "inbound_nodes": [[["activation_4", 0, 0]]], "config": {"size": [8, 8], "trainable": true, "name": "upsampling2d_4"}}, {"class_name": "UpSampling2D", "name": "upsampling2d_5", "inbound_nodes": [[["activation_5", 0, 0]]], "config": {"size": [16, 16], "trainable": true, "name": "upsampling2d_5"}}, {"class_name": "Convolution2D", "name": "convolution2d_2", "inbound_nodes": [[["upsampling2d_1", 0, 0]]], "config": {"W_constraint": null, "nb_col": 1, "bias": true, "activation": "linear", "b_regularizer": null, "trainable": true, "init": "he_normal", "activity_regularizer": null, "nb_filter": 64, "dim_ordering": "th", "name": "convolution2d_2", "b_constraint": null, "W_regularizer": null, "nb_row": 1, "subsample": [1, 1], "border_mode": "same"}}, {"class_name": "Convolution2D", "name": "convolution2d_4", "inbound_nodes": [[["upsampling2d_2", 0, 0]]], "config": {"W_constraint": null, "nb_col": 1, "bias": true, "activation": "linear", "b_regularizer": null, "trainable": true, "init": "he_normal", "activity_regularizer": null, "nb_filter": 128, "dim_ordering": "th", "name": "convolution2d_4", "b_constraint": null, "W_regularizer": null, "nb_row": 1, "subsample": [1, 1], "border_mode": "same"}}, {"class_name": "Convolution2D", "name": "convolution2d_6", "inbound_nodes": [[["upsampling2d_3", 0, 0]]], "config": {"W_constraint": null, "nb_col": 1, "bias": true, "activation": "linear", "b_regularizer": null, "trainable": true, "init": "he_normal", "activity_regularizer": null, "nb_filter": 256, "dim_ordering": "th", "name": "convolution2d_6", "b_constraint": null, "W_regularizer": null, "nb_row": 1, "subsample": [1, 1], "border_mode": "same"}}, {"class_name": "Convolution2D", "name": "convolution2d_8", "inbound_nodes": [[["upsampling2d_4", 0, 0]]], "config": {"W_constraint": null, "nb_col": 1, "bias": true, "activation": "linear", "b_regularizer": null, "trainable": true, "init": "he_normal", "activity_regularizer": null, "nb_filter": 512, "dim_ordering": "th", "name": "convolution2d_8", "b_constraint": null, "W_regularizer": null, "nb_row": 1, "subsample": [1, 1], "border_mode": "same"}}, {"class_name": "Convolution2D", "name": "convolution2d_10", "inbound_nodes": [[["upsampling2d_5", 0, 0]]], "config": {"W_constraint": null, "nb_col": 1, "bias": true, "activation": "linear", "b_regularizer": null, "trainable": true, "init": "he_normal", "activity_regularizer": null, "nb_filter": 512, "dim_ordering": "th", "name": "convolution2d_10", "b_constraint": null, "W_regularizer": null, "nb_row": 1, "subsample": [1, 1], "border_mode": "same"}}, {"class_name": "Merge", "name": "merge_1", "inbound_nodes": [[["convolution2d_2", 0, 0], ["convolution2d_4", 0, 0], ["convolution2d_6", 0, 0], ["convolution2d_8", 0, 0], ["convolution2d_10", 0, 0]]], "config": {"output_mask": null, "dot_axes": -1, "name": "merge_1", "arguments": {}, "output_shape_type": "raw", "mode_type": "raw", "output_shape": null, "concat_axis": 1, "output_mask_type": "raw", "mode": "concat"}}, {"class_name": "Convolution2D", "name": "convolution2d_11", "inbound_nodes": [[["merge_1", 0, 0]]], "config": {"W_constraint": null, "nb_col": 1, "bias": true, "activation": "sigmoid", "b_regularizer": null, "trainable": true, "init": "he_normal", "activity_regularizer": null, "nb_filter": 1, "dim_ordering": "th", "name": "convolution2d_11", "b_constraint": null, "W_regularizer": null, "nb_row": 1, "subsample": [1, 1], "border_mode": "valid"}}], "name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["convolution2d_11", 0, 0]]}}